In [1]:
import pandas as pd;

In [2]:
import numpy as np

In [3]:
dados = pd.read_excel("bateria.xlsx")

In [8]:
dados

           Unnamed: 0 Unnamed: 1 Unnamed: 2
1          1653993903          1        250
2          1653993964          1        250
3          1653994024          1        250
4          1653994084          1        250
5          1653994144          1        250
..                ...        ...        ...
183  1654005682.66667          1        249
184  1654005743.16667          1        249
185  1654005803.66667          1        250
186  1654005864.16667          1        250
187  1654005924.66667          1        250

[187 rows x 3 columns]

In [5]:
dados.drop([0], inplace=True)

In [9]:
dados = dados.rename(columns={'Unnamed: 0': 'UTC', 'Unnamed: 1': 'STATUS', 'Unnamed: 2': 'BATERRY LEVEL'})

In [10]:
dados.sort_values(by='UTC')

                  UTC STATUS BATERRY LEVEL
1          1653993903      1           250
2          1653993964      1           250
3          1653994024      1           250
4          1653994084      1           250
5          1653994144      1           250
..                ...    ...           ...
183  1654005682.66667      1           249
184  1654005743.16667      1           249
185  1654005803.66667      1           250
186  1654005864.16667      1           250
187  1654005924.66667      1           250

[187 rows x 3 columns]

In [11]:
# transformar a tabela em um datafram
dados = pd.DataFrame(dados)

In [12]:
dados = dados.rename(columns={'BATERRY LEVEL': 'bat_level'})

In [13]:
dados.shape

(187, 3)

In [14]:
# recebe o valor do número de linhas
tam = len(dados)

In [15]:
print(tam)

187

In [16]:
# array para a coluna status
status = np.array(dados['STATUS'])

In [17]:
print(status)

[1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1
 1 1]

In [18]:
# Array para guardar os valores de status = 1
h = np.where(dados['STATUS'] == 1)

In [19]:
print(h[0])

[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95 182 183 184 185 186]

In [20]:
#array para os dados da bat
bat = np.array(dados['bat_level'])

In [21]:
print(bat)

[250 250 250 250 250 250 250 250 250 250 250 250 250 250 250 252 252 252
 253 253 253 252 252 252 252 252 252 252 252 252 251 251 251 251 251 251
 251 251 251 251 251 251 251 251 251 251 251 251 250 250 250 250 250 250
 250 250 250 250 250 250 250 250 250 250 250 250 250 250 250 250 250 250
 250 250 250 250 250 250 250 250 250 253 253 253 252 252 252 252 252 252
 253 253 253 253 253 253 251 252 251 251 251 250 250 250 250 250 250 251
 251 251 250 250 250 250 250 250 250 250 250 250 250 250 250 250 250 249
 249 249 250 250 250 250 250 250 250 250 250 250 249 249 249 249 250 250
 250 250 250 250 249 249 249 249 249 249 249 249 249 249 249 249 249 249
 249 249 249 249 249 249 249 249 249 249 249 249 249 248 248 248 247 247
 247 248 249 249 250 250 250]

In [22]:
# Atribuir primeiro valor para controle de bat_level
z = np.where(dados['bat_level'] == h)

In [24]:
# Atribuir primeiro valor para controle de UTC
# y = dados['UTC'].min()
utc = np.array(dados['UTC'])

In [25]:
print(utc)

[1653993903 1653993964 1653994024 1653994084 1653994144 1653994205
 1653994264 1653994325 1653994385 1653994445 1653994506 1653994567
 1653994628 1653994681 1653994742 1653994807 1653994868 1653994929
 1653994989 1653995043 1653995104 1653995170 1653995230 1653995291
 1653995351 1653995411 1653995472 1653995532 1653995593 1653995654
 1653995712 1653995773 1653995834 1653995894 1653995955 1653996015
 1653996075 1653996135 1653996196 1653996257 1653996316 1653996377
 1653996437 1653996497 1653996558 1653996618 1653996679 1653996739
 1653996799 1653996860 1653996920 1653996980 1653997041 1653997102
 1653997161 1653997222 1653997283 1653997342 1653997403 1653997464
 1653997524 1653997585 1653997645 1653997705 1653997766 1653997826
 1653997886 1653997947 1653998008 1653998067 1653998127 1653998188
 1653998248 1653998309 1653998369 1653998429 1653998490 1653998550
 1653998610 1653998670 1653998731 1653998791 1653998852 1653998913
 1653998972 1653999033 1653999094 1653999153 1653999213 1653999274
 1653999334 1653999394 1653999455 1653999515 1653999575 1653999636
 1654000553 1654000564 1654000602 1654000664 1654000725 1654000783
 1654000846 1654000907 1654000964 1654001027 1654001088 1654001146
 1654001209 1654001270 1654001328 1654001390 1654001451 1654001509
 1654001572 1654001632 1654001691 1654001751 1654001812 1654001873
 1654001934 1654001995 1654002052 1654002113 1654002174 1654002233
 1654002296 1654002357 1654002417 1654002475 1654002536 1654002597
 1654002656 1654002719 1654002779 1654002837 1654002901 1654002961
 1654003022 1654003079 1654003140 1654003201 1654003260 1654003324
 1654003384 1654003442 1654003503 1654003565 1654003626 1654003686
 1654003747 1654003807 1654003868 1654003929 1654003989 1654004050
 1654004110 1654004168 1654004229 1654004290 1654004351 1654004412
 1654004473 1654004533 1654004594 1654004654 1654004714 1654004775
 1654004836 1654004893 1654004957 1654005017 1654005075 1654005138
 1654005198 1654005259 1654005319 1654005380 1654005441 1654005501
 1654005562 1654005622 1654005682.66667 1654005743.16667 1654005803.66667
 1654005864.16667 1654005924.66667]

In [26]:
print(status[h])

[1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1]

In [44]:
convertidos = pd.DataFrame(columns = ['bat_charge_start', 'bat_charge_end', 'bat_level_start', 'bat_level_end', 'bat_cycle', 'bat_cycle_total', 'ts_reg'])

In [43]:
convertidos.drop(['bat_charge_start', 'bat_charge_end', 'bat_level_start', 'bat_level_end', 'bat_cycle', 'bat_cycle_total', 'ts_reg'], axis=1, inplace=True)

In [ ]:
convertidos.drop

In [29]:
# Valor para guardar a informação dos valores iguais a 0;
b = np.where(dados['STATUS'] == 0)

In [30]:
print(b)

(array([ 96,  97,  98,  99, 100, 101, 102, 103, 104, 105, 106, 107, 108,
       109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121,
       122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134,
       135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147,
       148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160,
       161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173,
       174, 175, 176, 177, 178, 179, 180, 181], dtype=int64),)

In [33]:
# Exemplo de loc -> retornará o valor de 0
t = dados['UTC'].loc[96]

In [45]:
teste = 0
variavel = 0

for teste in range(tam):
  if status[teste] == 1 and variavel == 0:
    convertidos = convertidos.append({'bat_charge_start': utc[teste], 'bat_level_start': bat[teste]}, ignore_index= True)
    variavel = 1
 
  if status[teste] == 0 and variavel == 1:
    convertidos['bat_charge_end'].fillna(utc[teste], inplace=True)
    convertidos['bat_level_end'].fillna(bat[teste], inplace=True)
    variavel = 0
    
teste =+ 1

C:\Users\Igor Gabriel\AppData\Local\Temp\ipykernel_10436\625549061.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  convertidos = convertidos.append({'bat_charge_start': utc[teste], 'bat_level_start': bat[teste]}, ignore_index= True)
C:\Users\Igor Gabriel\AppData\Local\Temp\ipykernel_10436\625549061.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  convertidos = convertidos.append({'bat_charge_start': utc[teste], 'bat_level_start': bat[teste]}, ignore_index= True)

In [46]:
convertidos

,bat_charge_start,bat_charge_end,bat_level_start,bat_level_end,bat_cycle,bat_cycle_total,ts_reg
0,1653993903,1.654001e+09,250,251.0,NaN,NaN,NaN
1,1654005682.66667,NaN,249.0,NaN,NaN,NaN,NaN